examples/IndustrialAC-2/0.org/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    volScalarField;
    location "0";
    object   G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 0 -3 0 0 0 0];
internalField uniform 0;
boundaryField
{
    cathode
    {
        type MarshakRadiation;
        value uniform 0;
    }
    anode
    {
        type MarshakRadiation;
        value uniform 0;
    }
    sides
    {
        type MarshakRadiation;
        value uniform 0;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
