examples/IndustrialAC-2/0.org/ek
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    volScalarField;
    location "0";
    object   ek;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [-1 -3 3 0 0 2 0];
internalField uniform 1000;
boundaryField
{
    cathode
    {
        type zeroGradient;
    }
    anode
    {
        type zeroGradient;
    }
    sides
    {
        type zeroGradient;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
