examples/IndustrialAC-2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  https://openfoam.com                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-0.25 -0.25 0)
    (0.25 -0.25 0)
    (0.25 0.25 0)
    (-0.25 0.25 0)

    (-0.25 -0.25 0.07)
    (0.25 -0.25 0.07)
    (0.25 0.25 0.07)
    (-0.25 0.25 0.07)

    (-0.025 -0.025 0)
    (0.025 -0.025 0)
    (0.025 0.025 0)
    (-0.025 0.025 0)

    (-0.025 -0.025 0.07)
    (0.025 -0.025 0.07)
    (0.025 0.025 0.07)
    (-0.025 0.025 0.07)    
);

blocks
(
    hex (0 1 9 8 4 5 13 12) (21 21 30) simpleGrading 
    (
        1
        -30
        (
        (0.5 0.5 10)
        (0.5 0.5 0.1)
        )
    )
    hex (1 2 10 9 5 6 14 13) (21 21 30) simpleGrading 
    (
        1
        -30
        (
        (0.5 0.5 10)
        (0.5 0.5 0.1)
        )
    )
    hex (2 3 11 10 6 7 15 14) (21 21 30) simpleGrading 
    (
        1
        -30
        (
        (0.5 0.5 10)
        (0.5 0.5 0.1)
        )
    )
    hex (3 0 8 11 7 4 12 15) (21 21 30) simpleGrading 
    (
        1
        -30
        (
        (0.5 0.5 10)
        (0.5 0.5 0.1)
        )
    )
    hex (8 9 10 11 12 13 14 15) (21 21 30)
    simpleGrading 
    (
        1
        1
        (
        (0.5 0.5 10)
        (0.5 0.5 0.1)
        )
    )
);

edges
(
    arc 0 1 (0 -0.3536 0)
    arc 1 2 (0.3536 0 0)
    arc 2 3 (0 0.3536 0)
    arc 3 0 (-0.3536 0 0)
    arc 4 5 (0 -0.3536 0.07)
    arc 5 6 (0.3536 0 0.07)
    arc 6 7 (0 0.3536 0.07)
    arc 7 4 (-0.3536 0 0.07)
);

boundary
(
    cathode
    {
        type patch;
        faces
        (
            (12 13 14 15)
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
    anode
    {
        type patch;
        faces
        (
            (8 11 10 9)
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 8 0)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 1 5 4)
            (2 3 7 6)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //

